app/controllers/tasks_controller.rb

    task = Task.new(task_params)
    if task.save
---
INSERT INTO "tasks" ("description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["description", "dsds"], ["status", nil], ["created_at", "2024-02-09 15:13:59.147600"], ["updated_at", "2024-02-09 15:13:59.147600"]]